pet_shop/app/controllers/pets_controller.rb

SELECT "pets".* FROM "pets"
---
    def index
        @pets = Pet.all

SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 33], ["LIMIT", 1]]
---
    def find_pet
        @pet = Pet.find(params[:id])