pet_shop/app/controllers/species_controller.rb

SELECT "pets".* FROM "pets" WHERE (species LIKE 'snail')
---
    def index
        @pets = Pet.where("species LIKE ?", params[:species])